ka2_2024/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеПродукцииИМатериалов</name>
  <registerRecords>AccumulationRegister.ДвиженияПоНДС</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыМатериаловВПроизводство</registerRecords>
  <registerRecords>InformationRegister.ОперацииСПрослеживаемымиТоварами</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваровОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИсправленияДокументов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютахУчета</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>InformationRegister.ОперацииСПрослеживаемымиТоварамиРасширенный</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ПартииНДСКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюОтчетовКомитенту</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНТовары</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизацийКПередаче</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураНоменклатура</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоРаспоряжениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыЗапасовУказаныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаполненияМногооборотнойТары</name>
    <type>
      <types>EnumRef.СостоянияЗаполненияМногооборотнойТары</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьМаркируемаяПродукцияГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоТоварамКОформлениюОтчетовКомитенту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.РаспределениеВозвратныхОтходов</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПриемкиТоваров</name>
    <type>
      <types>EnumRef.ВариантыПриемкиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДвиженияПродукцииИМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Исправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <type>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправляемыйДокумент</name>
    <type>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <comment>Планируемая дата приемки товаров на складе</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УпаковкиВВидахЗапасов</name>
    <comment>Технический реквизит, указывающий детализацию видов запасов до упаковок.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеОтправителя</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерийОтправитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерийПолучатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПродукции</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПобочноеИзделие</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеОтправителя</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПродукции</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПолучателя</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасовПолучателя</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/CommonModules/ПроизводствоКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы "Производство"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Трудозатраты

// Открывает форму выбора исполнителя трудозатрат в производстве. В зависимости от параметров переданного
// подразделения в форме могут быть выбраны бригады и/или физические лица.
//
// Параметры:
//  Организация			 - СправочникСсылка.Организации - значение для отбора исполнителей.
//  Подразделение		 - СправочникСсылка.СтруктураПредприятия - определяет состав исполнителей, доступных для выбора.
//  Исполнитель			 - СправочникСсылка.Бригады, СправочникСсылка.ФизическиеЛица - используется для позиционирования строки
//							на выбранном ранее значении.
//  Дата				 - Дата - используется для определения режима открытия формы: по сотрудникам или физлицам.
//  ТолькоРаботники		 - Булево - ограничивает выбор бригад.
//  ОписаниеОповещения	 - ОписаниеОповещения - содержит описание процедуры, которая будет вызвана при закрытии формы.
//
Процедура ОткрытьФормуВыбораИсполнителя(Организация, Подразделение, Исполнитель, Дата, ТолькоРаботники = Ложь, ОписаниеОповещения) Экспорт
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Подразделение", Подразделение);
	ПараметрыФормы.Вставить("Исполнитель", Исполнитель);
	ПараметрыФормы.Вставить("Дата", Дата);
	ПараметрыФормы.Вставить("ТолькоРаботники", ТолькоРаботники);
	
	ОткрытьФорму("ОбщаяФорма.ВыборИсполнителя", ПараметрыФормы,,,,,ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область Продукция

// Открывает форму выбора получателя в производстве. В зависимости от типа номенклатуры выбранных строк
// в форме можно выбрать подразделение (структура предприятия) или склад
//
// Параметры:
//  Форма			     - ФормаКлиентскогоПриложения   - Обрабатываемая форма
//  Объект               - ДанныеФормыСтруктура - по типу объекта
//  ПараметрыТЧ		     - Структура          - содержит имена (представление) ТЧ: 
//											    ИмяТЧФорма      - имя таблицы формы
//                                              ИмяТЧОбъект     - имя табличной части объекта
//                                              ПредставлениеТЧ - представление табличной части для выводимых текстов
//  ТипыНоменклатуры     - Массив             - массив значений перечисления ТипыНоменклатуры для которых открывается форма,
//                                              если неопределено, тогда ограничения по типам не устанавливается
//  ОписаниеОповещения	 - ОписаниеОповещения - содержит описание процедуры, которая будет вызвана при закрытии формы
//
Процедура ОткрытьФормуВыбораПолучателя(Форма, Объект, ПараметрыТЧ, ТипыНоменклатуры = Неопределено, ОписаниеОповещения) Экспорт
	
	ИмяТЧФорма       = ПараметрыТЧ.ИмяТЧФорма;
	ИмяТЧОбъект      = ПараметрыТЧ.ИмяТЧОбъект;
	ПредставлениеТЧ  = ПараметрыТЧ.ПредставлениеТЧ;
	
	Элементы         = Форма.Элементы;
	ВыделенныеСтроки = Элементы[ИмяТЧФорма].ВыделенныеСтроки;
	
	Если Объект[ИмяТЧОбъект].Количество() = 0 Тогда
		
		ТекстОшибки = НСтр("ru = 'В список ""%1"" не введено ни одной строки.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ПредставлениеТЧ);
		
		ПоказатьПредупреждение(, ТекстОшибки, 45);
		Возврат;
		
	Иначе
		
		ТипНоменклатурыРабота   = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа");
		
		НаличиеЗапрещенногоТипа = Ложь;
		ВыборПодразделение      = Ложь;
		ВыборСклада             = Ложь;
		
		Для Каждого Строка Из ВыделенныеСтроки Цикл
			
			ДанныеСтроки = Объект[ИмяТЧОбъект].НайтиПоИдентификатору(Строка);
			
			Если ТипыНоменклатуры <> Неопределено 
				И ТипыНоменклатуры.Найти(ДанныеСтроки.ТипНоменклатуры) = Неопределено Тогда
				НаличиеЗапрещенногоТипа = Истина;
				Прервать;
			КонецЕсли;
			
			Если ДанныеСтроки.Свойство("СписатьНаРасходы")
					И ДанныеСтроки.СписатьНаРасходы
				Или ДанныеСтроки.ТипНоменклатуры = ТипНоменклатурыРабота Тогда
				ВыборПодразделение = Истина;
			Иначе
				ВыборСклада        = Истина;
			КонецЕсли;
			
			Если ВыборПодразделение И ВыборСклада Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НаличиеЗапрещенногоТипа Тогда
			
			ТекстОшибки = НСтр("ru = 'Для выбранной номенклатуры (тип ""%1"") операция не может быть выполнена.'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Строка(ДанныеСтроки.ТипНоменклатуры));
			
			ПоказатьПредупреждение(, ТекстОшибки, 45);
			Возврат;
			
		КонецЕсли;
		
		Если ВыборПодразделение И ВыборСклада Тогда
			
			ТекстОшибки = НСтр("ru = 'Выбраны строки с разными типами номенклатуры. Операция не может быть выполнена.'");
			
			ПоказатьПредупреждение(, ТекстОшибки, 45);
			Возврат;
			
		КонецЕсли;
		
		Если ВыборСклада
			И ПараметрыТЧ.Свойство("СкладВШапке")
			И ПараметрыТЧ.СкладВШапке Тогда
			
			ТекстОшибки = НСтр("ru = 'Склад для товаров списка ""%1"" указывается в шапке документа.'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, ПредставлениеТЧ);
			
			ПоказатьПредупреждение(, ТекстОшибки, 45);
			Возврат;
			
		КонецЕсли;
		
		Если ВыборСклада
			И ПараметрыТЧ.Свойство("ОставитьИзделияУПереработчика")
			И ПараметрыТЧ.ОставитьИзделияУПереработчика Тогда
			
			ТекстОшибки = НСтр("ru = 'Изделия остаются для последующей обработки. Склад указывать не требуется.'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, ПредставлениеТЧ);
			
			ПоказатьПредупреждение(, ТекстОшибки, 45);
			Возврат;
			
		КонецЕсли;
		
		Если ВыборСклада Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			
			Если ПараметрыТЧ.Свойство("Отбор") Тогда
				ПараметрыФормы.Вставить("Отбор", ПараметрыТЧ.Отбор);
			КонецЕсли;
			
			Если ПараметрыТЧ.Свойство("ГруппаСкладов") Тогда
				ПараметрыФормы.Вставить("ГруппаСкладов", ПараметрыТЧ.ГруппаСкладов);
			КонецЕсли;
			
			ОткрытьФорму(
				"Справочник.Склады.ФормаВыбора",
				ПараметрыФормы, Форма,,,,
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
		Если ВыборПодразделение Тогда
			
			ОткрытьФорму("Справочник.СтруктураПредприятия.ФормаВыбора",, Форма,,,,
						  ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область РасчетДолейСтоимости

// Функция проверяет необходимость обновления процента распределения затрат на выходные изделия.
//
// Параметры:
//  ТабличнаяЧасть				 - ТаблицаФормы	 - таблица формы, отображающая ТЧ;
//  ПараметрыРаспределенияЗатрат - Структура	 - структура параметров расчета, см. ПроизводствоКлиентСервер.ПараметрыРаспределенияЗатратНаВыходныеИзделия
//  КэшированныеЗначения		 - Структура	 - структура кеша реквизитов текущей строки.
//  ДобавлениеУдаление			 - Булево		 - признак, что проверка вызывается при добавлении/удалении строки ТЧ.
// 
// Возвращаемое значение:
//  Булево - истина, если нужно ли обновить служебные реквизиты.
//
Функция НеобходимоРассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(ТабличнаяЧасть, ПараметрыРаспределенияЗатрат, КэшированныеЗначения = Неопределено, ДобавлениеУдаление = Ложь) Экспорт
	
	ДанныеСтроки = ТабличнаяЧасть.ТекущиеДанные;
	
	Если ДобавлениеУдаление Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПустаяСтрока(ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия) Тогда
		СпособРаспределенияЗатратНаВыходныеИзделия = ПараметрыРаспределенияЗатрат.СпособРаспределенияЗатратНаВыходныеИзделия;
	Иначе
		СпособРаспределенияЗатратНаВыходныеИзделия = ДанныеСтроки[ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СпособРаспределенияЗатратНаВыходныеИзделия) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПроверяемыеПоля = Новый Массив;
	ПроверяемыеПоля.Добавить("ДоляСтоимости");
	ПроверяемыеПоля.Добавить(ПараметрыРаспределенияЗатрат.ПоляСвязи);
	
	Если ЗначениеЗаполнено(ПараметрыРаспределенияЗатрат.ПолеГруппировкиЗатрат) Тогда
		ПроверяемыеПоля.Добавить(ПараметрыРаспределенияЗатрат.ПолеГруппировкиЗатрат);
	КонецЕсли;
	
	Если СпособРаспределенияЗатратНаВыходныеИзделия = ПредопределенноеЗначение("Перечисление.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости")
		И ДанныеСтроки <> Неопределено
		И ДанныеСтроки.ДоляСтоимости = 0 Тогда
		ПроверяемыеПоля.Добавить("Количество");
	КонецЕсли;
	
	Если ПараметрыРаспределенияЗатрат.ЕстьПолеОтменено Тогда
		ПроверяемыеПоля.Добавить("Отменено");
	КонецЕсли;
	
	Если ДанныеСтроки <> Неопределено
		И КэшированныеЗначения <> Неопределено
		И ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(
			КэшированныеЗначения,
			ДанныеСтроки,
			СтрСоединить(ПроверяемыеПоля,",")) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Предназначена для проверки заполнения полей перед выполнением команды по вводу доли стоимости.
//
// Параметры:
//  ДанныеСтроки				 - ДанныеФормыСтруктура	 - данные строки, в которой осуществляется ввод доли стоимости.
//  ПараметрыРаспределенияЗатрат - Структура			 - структура параметров расчета, см. ПроизводствоКлиентСервер.ПараметрыРаспределенияЗатратНаВыходныеИзделия
//  ИмяОбъекта					 - Строка				 - имя основного реквизита формы, связанного с редактируемым объектом.
// 
// Возвращаемое значение:
//  Булево - истина, если проверка заполнения выполнена успешно, ложь - в противном случае.
//
Функция ПроверитьЗаполнениеПередВводомДолиСтоимости(ДанныеСтроки, ПараметрыРаспределенияЗатрат, ИмяОбъекта = "Объект") Экспорт
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ошибки = Новый Массив();
	
	Если Не ЗначениеЗаполнено(ДанныеСтроки.Номенклатура) Тогда
		Текст = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Номенклатура'"));
		Ошибка = Новый Структура("Поле, Текст", "Номенклатура", Текст);
		Ошибки.Добавить(Ошибка);
	КонецЕсли;
	
	Если (ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСтроки, "КоличествоУпаковок")
			И ДанныеСтроки.КоличествоУпаковок = 0
			ИЛИ ДанныеСтроки.Количество = 0)
		И (НЕ ПараметрыРаспределенияЗатрат.ЕстьПараметризацияРесурснойСпецификации
			ИЛИ ПараметрыРаспределенияЗатрат.ЕстьПараметризацияРесурснойСпецификации И НЕ ДанныеСтроки.РасчетПоФормуле) Тогда
		
		Текст = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Количество'"));
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСтроки, "КоличествоУпаковок") Тогда
			Ошибка = Новый Структура("Поле, Текст", "КоличествоУпаковок", Текст);
		Иначе
			Ошибка = Новый Структура("Поле, Текст", "Количество", Текст);
		КонецЕсли;
		
		Ошибки.Добавить(Ошибка);
		
	КонецЕсли;
	
	Если Не ДоступнаРасшифровкаРасчетаДолиСтоимости(ДанныеСтроки, ПараметрыРаспределенияЗатрат) Тогда
		Текст = НСтр("ru = 'Недостаточно прав доступа для открытия формы расшифровки расчета доли стоимости.'");
		Ошибка = Новый Структура("Поле, Текст", "ДоляСтоимости", Текст);
		Ошибки.Добавить(Ошибка);
	КонецЕсли;
	
	ОшибкиПользователю = Неопределено;

	Для каждого Ошибка Из Ошибки Цикл
		Поле = СтрШаблон(ИмяОбъекта + ".%1[%2].%3", ПараметрыРаспределенияЗатрат.ИмяТЧ, Формат(ДанныеСтроки.НомерСтроки - 1, "ЧН=0; ЧГ=0"), Ошибка.Поле);
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(ОшибкиПользователю, Поле, Ошибка.Текст, "");
	КонецЦикла;

	ОчиститьСообщения();
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ОшибкиПользователю);

	Возврат Ошибки.Количество() = 0;

КонецФункции

#КонецОбласти

#Область ПроизводствоБезЗаказов

// Оформить производство без заказа на основании.
// 
// Параметры:
//  МассивСсылок - Массив Из ДокументСсылка
//  ПараметрыВыполнения - см. ПодключаемыеКомандыКлиент.ПараметрыВыполненияКоманды
//
Процедура ОформитьПроизводствоБезЗаказаНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОбщийМодуль.ПроизводствоКлиент.ОформитьПроизводствоБезЗаказаНаОсновании");
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);
	
	ПараметрыДокументов = ПроизводствоКлиентСервер.ПараметрыФормированияДокументовПроизводстваБезЗаказов();
	ПараметрыДокументов.ПериодРегистрации = Дата(3999,12,31);
	ПараметрыДокументов.ЗаполнятьАвтоматически = Истина;
	
	ПараметрыДокументов.ПереченьДанных.Добавить("ВозвратныеОтходы");
	ПараметрыДокументов.ПереченьДанных.Добавить("МатериалыИУслуги");
	ПараметрыДокументов.ПереченьДанных.Добавить("Трудозатраты");
	
	ФормаДокумента = ПолучитьФорму("Документ.ПроизводствоБезЗаказа.ФормаОбъекта",, ПараметрыВыполненияКоманды.Источник);
	ПараметрыДокументов.ОбъектыФормы.Вставить("ПроизводствоБезЗаказа", ФормаДокумента.Объект);
	
	Результат = ПроизводствоВызовСервера.ОформитьПроизводствоБезЗаказаНаОсновании(МассивСсылок, ПараметрыДокументов);
	ОбработатьСформированныеДокументы(ПараметрыВыполненияКоманды.Источник, Результат, Ложь);
	
КонецПроцедуры

// Обработать сформированные документы производства без заказа.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Результат - Структура
//  ОповещатьОЗакрытии - Булево - оповещать о закрытии
//  ОписаниеОповещенияОЗакрытии - ОписаниеОповещения - оповещение о закрытии
//
Процедура ОбработатьСформированныеДокументы(Форма, Результат, ОповещатьОЗакрытии = Истина, ОписаниеОповещенияОЗакрытии = Неопределено) Экспорт
	
	ОписаниеОповещения = Неопределено;
	Если ОповещатьОЗакрытии
		И ОписаниеОповещенияОЗакрытии = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьДанныеСписков", Форма);
	ИначеЕсли ОповещатьОЗакрытии Тогда
		ОписаниеОповещения = ОписаниеОповещенияОЗакрытии;
	КонецЕсли;
	
	Если Не Результат.ОбъектФормы = Неопределено Тогда
		
		ФормаДокумента = ПолучитьФорму("Документ." + Результат.ТипДокумента + ".ФормаОбъекта", Результат, Форма);
		КопироватьДанныеФормы(Результат.ОбъектФормы, ФормаДокумента.Объект);
		ФормаДокумента.ОбновитьПриОткрытии = Истина;
		ФормаДокумента.Модифицированность = Истина;
		ФормаДокумента.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаДокумента.Открыть();
		
	ИначеЕсли Результат.СписокДокументов.Количество() > 1 Тогда
		
		ОткрытьФорму(
			"Обработка.ОформлениеПроизводстваБезЗаказов.Форма.ФормаСпискаНовыхДокументов",
			Результат,
			Форма,,,,
			ОписаниеОповещения);
			
	Иначе
		
		Если Результат.МассивОшибок.Количество() = 1 Тогда
			ПоказатьПредупреждение(,Результат.МассивОшибок[0].Текст);
		Иначе
			Для Каждого ТекущаяОшибка Из Результат.МассивОшибок Цикл
				ТекущаяОшибка.Сообщить();
			КонецЦикла;
			ПоказатьПредупреждение(,НСтр("ru = 'Не сформировано ни одного документа.'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасчетДолейСтоимости

Функция ДоступнаРасшифровкаРасчетаДолиСтоимости(ДанныеСтроки, ПараметрыРаспределенияЗатрат) Экспорт
	
	Если ПустаяСтрока(ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия) Тогда
		СпособРаспределенияЗатратНаВыходныеИзделия = ПараметрыРаспределенияЗатрат.СпособРаспределенияЗатратНаВыходныеИзделия;
	Иначе
		СпособРаспределенияЗатратНаВыходныеИзделия = ДанныеСтроки[ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия];
	КонецЕсли;
	
	Если СпособРаспределенияЗатратНаВыходныеИзделия = ПредопределенноеЗначение("Перечисление.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоПлановойСтоимости") Тогда
		ЕстьДоступ = ПроизводствоВызовСервера.ДоступнаРасшифровкаРасчетаДолиСтоимости(СпособРаспределенияЗатратНаВыходныеИзделия);
	Иначе
		ЕстьДоступ = Истина;
	КонецЕсли;
	
	Возврат ЕстьДоступ;
	
КонецФункции

#КонецОбласти

#Область ДвижениеПродукцииИМатериалов

// Обработчик команды ввода на основании "ПроизводствоСервер.ДобавитьКомандуСоздатьВыпускПродукцииНаОсновании".
//
// Параметры:
//  МассивСсылок - Массив - массив ссылок
//  ПараметрыВыполнения - Структура:
//                         * ОписаниеКоманды - Структура:
//                            ** Идентификатор           - Строка  - Идентификатор команды.
//                            ** Представление           - Строка  - Представление команды в форме.
//                            ** ДополнительныеПараметры - Структура - Дополнительные параметры команды.
//                            ** МножественныйВыбор      - Булево - признак множественного выбора.
//                        * Форма           - ФормаКлиентскогоПриложения - Форма, из которой вызвана команда.
//                        * ЭтоФормаОбъекта - Булево - Истина, если команда вызвана из формы объекта.
//                        * Источник        - ТаблицаФормы, ДанныеФормыСтруктура - Объект или список формы с полем "Ссылка".
//
// Возвращаемое значение:
//  Неопределено - 
//
Функция СоздатьПередачуПродукцииИзКладовойНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт

	Массив = Новый Массив;
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		Массив.Добавить(МассивСсылок);
	Иначе
		Массив = МассивСсылок;
	КонецЕсли;
	
	ПараметрыВыполнения.ОписаниеКоманды.Вставить("ОбъектыОснований", Массив);
	СоздатьДвижениеПродукцииИМатериаловНаОсновании(
		ПараметрыВыполнения.ОписаниеКоманды, 
		ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзКладовой"));
	
КонецФункции

// Обработчик команды ввода на основании "ПроизводствоСервер.ДобавитьКомандуСоздатьПередачуМатериаловНаОсновании".
//
// Параметры:
//  МассивСсылок - Массив - массив ссылок
//  ПараметрыВыполнения - Структура:
//                         * ОписаниеКоманды - Структура:
//                            ** Идентификатор           - Строка  - Идентификатор команды.
//                            ** Представление           - Строка  - Представление команды в форме.
//                            ** ДополнительныеПараметры - Структура - Дополнительные параметры команды.
//                            ** МножественныйВыбор      - Булево - признак множественного выбора.
//                        * Форма           - ФормаКлиентскогоПриложения - Форма, из которой вызвана команда.
//                        * ЭтоФормаОбъекта - Булево - Истина, если команда вызвана из формы объекта.
//                        * Источник        - ТаблицаФормы, ДанныеФормыСтруктура - Объект или список формы с полем "Ссылка".
//
// Возвращаемое значение:
//  Неопределено - 
//
Функция СоздатьПередачуМатериаловВКладовуюНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	Массив = Новый Массив;
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		Массив.Добавить(МассивСсылок);
	Иначе
		Массив = МассивСсылок;
	КонецЕсли;
	
	ПараметрыВыполнения.ОписаниеКоманды.Вставить("ОбъектыОснований", Массив);
	СоздатьДвижениеПродукцииИМатериаловНаОсновании(
		ПараметрыВыполнения.ОписаниеКоманды, 
		ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую"));
	
КонецФункции

Процедура СоздатьДвижениеПродукцииИМатериаловНаОсновании(ОписаниеКоманды, ХозяйственнаяОперация)
	
	ПараметрыОткрытия = ПроизводствоВызовСервера.ПараметрыСозданияДвиженияПродукцииИМатериаловНаОсновании(
		ОписаниеКоманды.ОбъектыОснований, ХозяйственнаяОперация);
	
	Если ПараметрыОткрытия.РезультатыПроверки.ЕстьОшибки Тогда
		
		НакладныеКлиент.СообщитьОбОшибкахЗаполненияВнутреннейНакладной(ПараметрыОткрытия.РезультатыПроверки.ТекстОшибки);
		
	Иначе
		
		ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
		ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ОписаниеКоманды.ДополнительныеПараметры);
		
		ОткрытьФорму(
			"Документ.ДвижениеПродукцииИМатериалов.ФормаОбъекта",
			ПараметрыОткрытия,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно,
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик команды ввода на основании "ПроизводствоСервер.ДобавитьКомандуСоздатьВыпускПродукцииБезЗаказаНаОсновании".
//
// Параметры:
//  МассивСсылок - Массив - массив ссылок
//  ПараметрыВыполнения - Структура:
//                         * ОписаниеКоманды - Структура:
//                            ** Идентификатор           - Строка  - Идентификатор команды.
//                            ** Представление           - Строка  - Представление команды в форме.
//                            ** ДополнительныеПараметры - Структура - Дополнительные параметры команды.
//                            ** МножественныйВыбор      - Булево - признак множественного выбора.
//                        * Форма           - ФормаКлиентскогоПриложения - Форма, из которой вызвана команда.
//                        * ЭтоФормаОбъекта - Булево - Истина, если команда вызвана из формы объекта.
//                        * Источник        - ТаблицаФормы, ДанныеФормыСтруктура - Объект или список формы с полем "Ссылка".
//
// Возвращаемое значение:
//  Неопределено - 
//
Функция СоздатьВыпускПродукцииБезЗаказаНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт

	// СтандартныеПодсистемы.ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОбщийМодуль.ПроизводствоКлиент.СоздатьВыпускПродукцииБезЗаказаНаОсновании");
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
	Массив = Новый Массив;
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		Массив.Добавить(МассивСсылок);
	Иначе
		Массив = МассивСсылок;
	КонецЕсли;
	
	ПараметрыВыполнения.ОписаниеКоманды.Вставить("ОбъектыОснований", Массив);
	ПараметрыДокументов = Новый Структура;
	ПараметрыДокументов.Вставить("ОбъектыОснований", Массив);
	
	ФормаДокумента = ПолучитьФорму("Документ.ДвижениеПродукцииИМатериалов.ФормаОбъекта",,, ПараметрыВыполнения.Форма,);
	ПараметрыДокументов.Вставить("ОбъектФормы", ФормаДокумента.Объект);
	
	ИдентификаторФормы = Строка(ПараметрыВыполнения.Форма.УникальныйИдентификатор);
	ПараметрыДокументов.Вставить("ИдентификаторФормы", ИдентификаторФормы);
	
	Результат = ПроизводствоВызовСервера.ДокументыДвиженияПродукцииИМатериаловПоПараметрам(ПараметрыДокументов);
	
	Если Результат.Свойство("ОткрытьФормуНового") Тогда
		
		КопироватьДанныеФормы(ПараметрыДокументов.ОбъектФормы, ФормаДокумента.Объект);
		ФормаДокумента.ОбновитьПриОткрытии = Истина;
		ФормаДокумента.Модифицированность = Истина;
		ФормаДокумента.Открыть();
		
	ИначеЕсли Результат.КоличествоСозданныхДокументов > 1 Тогда
		
		НакладныеКлиент.ОткрытьФормуСозданныхДокументов(Результат, ПараметрыВыполнения.Форма);
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Не сформировано ни одного документа. Отсутствует продукция, требующая передачи на склад.'"));
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Заполнение

// Заполняет служебные реквизиты в строке на основании выбранного склада
//
// Параметры:
//  ТекущаяСтрока		 - Структура - данные обрабатываемой строки.
//  Параметры			 - Структура - вспомогательные параметры для заполнения.
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке.
//
Процедура ЗаполнитьПризнакЦеховаяКладовая(ТекущаяСтрока, Параметры, КэшированныеЗначения) Экспорт
	
	ИмяПоляСклад = "Склад";
	ЗначениеСклада = Неопределено;
	ЗаполнитьПодразделение = Ложь;
	
	Если Параметры <> Неопределено Тогда
		
		Если Параметры.Свойство("ИмяПоляСклад") Тогда
			ИмяПоляСклад = Параметры.ИмяПоляСклад;	
		КонецЕсли;
			
		Если Параметры.Свойство("ЗаполнитьПодразделение") Тогда
			ЗаполнитьПодразделение = Параметры.ЗаполнитьПодразделение;	
		КонецЕсли;		
		
		Параметры.Свойство("ЗначениеСклада", ЗначениеСклада);
		
	КонецЕсли;
	
	Если ЗначениеСклада = Неопределено Тогда
		ЗначениеСклада = ТекущаяСтрока[ИмяПоляСклад];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСклада) И ТипЗнч(ЗначениеСклада) = Тип("СправочникСсылка.Склады") Тогда
		
		СвойстваСклада = КэшированныеЗначения.СвойстваСкладов.Получить(ЗначениеСклада);
		
		Если СвойстваСклада = Неопределено Тогда
			
			ТекстИсключения = 
				НСтр("ru = 'Попытка заполнения служебных реквизитов на основании выбранного склада на клиенте.'");
			ВызватьИсключение ТекстИсключения;
			
		КонецЕсли;	
		
		ЦеховаяКладовая = СвойстваСклада.ЦеховаяКладовая;
		Подразделение = СвойстваСклада.Подразделение;
		
	Иначе
		
		ЦеховаяКладовая = Ложь;
		Подразделение = Неопределено;
		
	КонецЕсли;
	
	ТекущаяСтрока.ЦеховаяКладовая = ЦеховаяКладовая;
	
	Если ЗаполнитьПодразделение И ТекущаяСтрока.ЦеховаяКладовая Тогда
		ТекущаяСтрока.Подразделение = Подразделение;
	КонецЕсли;
	
	Если ТекущаяСтрока.Свойство("НужноОкруглять") Тогда
		ТекущаяСтрока.НужноОкруглять = Не ТекущаяСтрока.ЦеховаяКладовая;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Типы затрат для выбора статьи калькуляции.
// 
// Параметры:
//  ИмяТЧ - Строка
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ТипыЗатрат
Функция ТипыЗатратДляВыбораСтатьиКалькуляции(ИмяТЧ) Экспорт
	
	ТипыЗатрат = Новый Массив;
	
	Если ИмяТЧ = "МатериалыИУслуги"
		ИЛИ ИмяТЧ = "ОбеспечениеМатериаламиИРаботами"
		ИЛИ ИмяТЧ = "РасходМатериаловИРабот" Тогда
		ТипыЗатрат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЗатрат.Материальные"));
	ИначеЕсли ИмяТЧ ="Трудозатраты" Тогда
		ТипыЗатрат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЗатрат.ОплатаТруда"));
	ИначеЕсли ИмяТЧ = "ВозвратныеОтходы"
		ИЛИ ИмяТЧ = "ПобочныеИзделия" Тогда
		ТипыЗатрат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЗатрат.Материальные"));
		ТипыЗатрат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЗатрат.ВозвратныеОтходы"));
	КонецЕсли; 
	
	Возврат ТипыЗатрат;
	
КонецФункции

// Обработчик команды ввода на основании "Документ.АктВыполненныхВнутреннихРабот.СозданиеАктаВыполненныхВнутреннихРабот".
//
// Параметры:
//  МассивСсылок - Массив - массив ссылок
//  ПараметрыВыполнения - Структура:
//                         * ОписаниеКоманды - Структура:
//                            ** Идентификатор           - Строка  - Идентификатор команды.
//                            ** Представление           - Строка  - Представление команды в форме.
//                            ** ДополнительныеПараметры - Структура - Дополнительные параметры команды.
//                            ** МножественныйВыбор      - Булево - признак множественного выбора.
//                        * Форма           - ФормаКлиентскогоПриложения - Форма, из которой вызвана команда.
//                        * ЭтоФормаОбъекта - Булево - Истина, если команда вызвана из формы объекта.
//                        * Источник        - ТаблицаФормы, ДанныеФормыСтруктура - Объект или список формы с полем "Ссылка".
//
// Возвращаемое значение:
//  Неопределено - 
//
Функция СоздатьАктВыполненныхВнутреннихРаботНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	// СтандартныеПодсистемы.ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОбщийМодуль.ПроизводствоКлиент.СоздатьАктВыполненныхВнутреннихРаботНаОсновании");
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
	ОчиститьСообщения();
	
	РезультатПроверки = ПроизводствоВызовСервера.СоздатьАктВыполненныхВнутреннихРаботПроверкаОснований(МассивСсылок);
	Если РезультатПроверки.Свойство("ЕстьОшибки") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверки.ТекстОшибки);
	Иначе
		ПараметрыОснование = Новый Структура;
		ПараметрыОснование.Вставить("ОбъектыОснований",	МассивСсылок);
		ПараметрыОснование.Вставить("РеквизитыШапки",	РезультатПроверки.РеквизитыШапки);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Основание", ПараметрыОснование);
		
		ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
		ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);
		
		ИмяФормы = "Документ.АктВыполненныхВнутреннихРабот.ФормаОбъекта";
		ОткрытьФорму(
				ИмяФормы,
				ПараметрыОткрытия,
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Уникальность,
				ПараметрыВыполненияКоманды.Окно,
				ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
